app/Controllers/BaseController.php

    protected function loadSettings()
    {
        $settingModel = new SettingModel();
        $allSettings = $settingModel->findAll();
---
SELECT *
FROM `settings`