app/Controllers/Home.php

    public function index()
    {

        // Get featured products with images
        $featuredProducts = $this->productModel->where('featured', 1)
                                              ->where('status', 'active')
                                              ->limit(8)
                                              ->find();

        // Get hot selling products with images
        $hotSellingProducts = $this->productModel->where('hot_selling', 1)
                                                ->where('status', 'active')
                                                ->limit(8)
                                                ->find();

        // Get hot products (products with high sales or views - for now using hot_selling as hot products)
        $hotProducts = $this->productModel->where('hot_selling', 1)
                                         ->where('status', 'active')
                                         ->limit(8)
                                         ->find();

        // Get product images for featured products
        foreach ($featuredProducts as &$product) {
            $product['images'] = $this->productImageModel->where('product_id', $product['id'])
                                                        ->orderBy('is_primary', 'DESC')
                                                        ->orderBy('sort_order', 'ASC')
                                                        ->find();
---
SELECT *
FROM `products`
WHERE `featured` = 1
AND `status` = 'active'
 LIMIT 8
SELECT *
FROM `products`
WHERE `hot_selling` = 1
AND `status` = 'active'
 LIMIT 8
SELECT *
FROM `product_images`
WHERE `product_id` = '2'
ORDER BY `is_primary` DESC, `sort_order` ASC

        }

        // Get categories that should show on homepage
        $categories = $this->categoryModel->where('status', 'active')
                                         ->where('show_on_homepage', 1)
                                         ->orderBy('sort_order', 'ASC')
                                         ->find();
---
SELECT *
FROM `categories`
WHERE `status` = 'active'
AND `show_on_homepage` = 1
ORDER BY `sort_order` ASC