app/Controllers/Search.php

SELECT *
FROM `products`
WHERE `name` LIKE '%dsa%' ESCAPE '!'
OR  `description` LIKE '%dsa%' ESCAPE '!'
OR  `short_description` LIKE '%dsa%' ESCAPE '!'
AND `status` = 'active'
 LIMIT 12
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `name` LIKE '%dsa%' ESCAPE '!'
OR  `description` LIKE '%dsa%' ESCAPE '!'
OR  `short_description` LIKE '%dsa%' ESCAPE '!'
AND `status` = 'active'
SELECT *
FROM `categories`
WHERE `name` LIKE '%dsa%' ESCAPE '!'
OR  `description` LIKE '%dsa%' ESCAPE '!'
AND `status` = 'active'
SELECT *
FROM `product_images`
WHERE `product_id` = '5'
ORDER BY `is_primary` DESC, `sort_order` ASC
---
    public function index()
    {
        $query = $this->request->getGet('q');
        $page = (int) ($this->request->getGet('page') ?? 1);
        $perPage = 12;
        $offset = ($page - 1) * $perPage;

        $products = [];
        $totalProducts = 0;
        $categories = [];

        if (!empty($query)) {
            // Search products
            $products = $this->productModel->like('name', $query)
                ->orLike('description', $query)
                ->orLike('short_description', $query)
                ->where('status', 'active')
                ->findAll($perPage, $offset);

            $totalProducts = $this->productModel->like('name', $query)
                ->orLike('description', $query)
                ->orLike('short_description', $query)
                ->where('status', 'active')
                ->countAllResults();

            // Search categories
            $categories = $this->categoryModel->like('name', $query)
                ->orLike('description', $query)
                ->where('status', 'active')
                ->findAll();

            // Get product images
            foreach ($products as &$product) {
                $product['images'] = $this->productImageModel->where('product_id', $product['id'])
                    ->orderBy('is_primary', 'DESC')
                    ->orderBy('sort_order', 'ASC')
                    ->find();