app/Controllers/Shop.php

SELECT *
FROM `product_images`
WHERE `product_id` = '6'
ORDER BY `is_primary` DESC, `sort_order` ASC
---

        // Get product images for each product
        foreach ($products as &$product) {
            $product['images'] = $this->productImageModel->where('product_id', $product['id'])
                                                        ->orderBy('is_primary', 'DESC')
                                                        ->orderBy('sort_order', 'ASC')
                                                        ->find();

SELECT *
FROM `categories`
WHERE `status` = 'active'
ORDER BY `name` ASC
SELECT COUNT(*) AS `numrows`
FROM `products`
WHERE `category_id` = '3'
AND `status` = 'active'
---
    public function index()
    {

        // Get all categories for sidebar with product counts
        $categories = $this->categoryModel->where('status', 'active')
                                         ->orderBy('name', 'ASC')
                                         ->findAll();

        // Add product counts to each category
        foreach ($categories as &$category) {
            $category['product_count'] = $this->productModel->where('category_id', $category['id'])
                                                           ->where('status', 'active')
                                                           ->countAllResults();

SELECT *
FROM `products`
WHERE `slug` = 'dasd'
AND `status` = 'active'
 LIMIT 1
SELECT *
FROM `product_images`
WHERE `product_id` = '3'
ORDER BY `is_primary` DESC, `sort_order` ASC
SELECT *
FROM `products`
WHERE `category_id` = '2'
AND `id` != '3'
AND `status` = 'active'
 LIMIT 4
---
    public function product($slug)
    {
        $product = $this->productModel->where('slug', $slug)
                                     ->where('status', 'active')
                                     ->first();

        if (!$product) {
            throw new \CodeIgniter\Exceptions\PageNotFoundException('Product not found');
        }

        // Get product images
        $product['images'] = $this->productImageModel->where('product_id', $product['id'])
                                                    ->orderBy('is_primary', 'DESC')
                                                    ->orderBy('sort_order', 'ASC')
                                                    ->find();

        // Get product variants
        $product['variants'] = $this->productVariantModel->getProductVariants($product['id']);

        // Get available colors and sizes for this product
        $product['colors'] = $this->productColorModel->getActiveColors();
        $product['sizes'] = $this->productSizeModel->getActiveSizes();

        // Get related products (same category, excluding current product)
        $relatedProducts = $this->productModel->where('category_id', $product['category_id'])
                                             ->where('id !=', $product['id'])
                                             ->where('status', 'active')
                                             ->limit(4)
                                             ->findAll();