app/Models/ProductVariantModel.php

SELECT `product_variants`.*, `ps`.`name` as `size_name`, `pc`.`name` as `color_name`, `pc`.`hex_code`
FROM `product_variants`
LEFT JOIN `product_sizes` `ps` ON `ps`.`id` = `product_variants`.`size_id`
LEFT JOIN `product_colors` `pc` ON `pc`.`id` = `product_variants`.`color_id`
WHERE `product_variants`.`product_id` = '3'
ORDER BY `product_variants`.`id` ASC
---
    public function getProductVariants($productId)
    {
        return $this->select('product_variants.*, ps.name as size_name, pc.name as color_name, pc.hex_code')
                    ->join('product_sizes ps', 'ps.id = product_variants.size_id', 'left')
                    ->join('product_colors pc', 'pc.id = product_variants.color_id', 'left')
                    ->where('product_variants.product_id', $productId)
                    ->orderBy('product_variants.id', 'ASC')
                    ->findAll();