app/Models/ProductColorModel.php

SELECT *
FROM `product_colors`
WHERE `status` = 'active'
ORDER BY `sort_order` ASC
---
    public function getActiveColors()
    {
        return $this->where('status', 'active')->orderBy('sort_order', 'ASC')->findAll();