app/Models/ProductSizeModel.php

    public function getActiveSizes()
    {
        return $this->where('status', 'active')->orderBy('sort_order', 'ASC')->findAll();
---
SELECT *
FROM `product_sizes`
WHERE `status` = 'active'
ORDER BY `sort_order` ASC