app/Models/SliderModel.php

    public function getActiveSliders()
    {
        return $this->where('status', 'active')
                   ->orderBy('sort_order', 'ASC')
                   ->find();
---
SELECT *
FROM `sliders`
WHERE `status` = 'active'
ORDER BY `sort_order` ASC